OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf707.h
extern __at(0x0005) volatile __PORTAbits_t PORTAbits;

#define _RA0                    0x01
#define _AN0                    0x01
#define _RA1                    0x02
#define _AN1                    0x02
#define _CPSA0                  0x02
#define _RA2                    0x04
#define _AN2                    0x04
#define _CPSA1                  0x04
#define _DACOUT                 0x04
#define _RA3                    0x08
#define _AN3                    0x08
#define _CPSA2                  0x08
#define _RA4                    0x10
#define _CPSA3                  0x10
#define _T0CKI                  0x10
#define _TACKI                  0x10
#define _RA5                    0x20
#define _AN4                    0x20
#define _CPSA4                  0x20
#define _RA6                    0x40
#define _OSC2                   0x40
#define _CPSB1                  0x40
#define _CLKOUT                 0x40
#define _RA7                    0x80
#define _OSC1                   0x80
#define _CPSB0                  0x80
#define _CLKIN                  0x80

//==============================================================================


//==============================================================================
//        PORTB Bits

extern __at(0x0006) __sfr PORTB;

typedef union
  {
  struct
    {
    unsigned RB0                : 1;
    unsigned RB1                : 1;
    unsigned RB2                : 1;
    unsigned RB3                : 1;
    unsigned RB4                : 1;
    unsigned RB5                : 1;
    unsigned RB6                : 1;
    unsigned RB7                : 1;
    };

  struct
    {
    unsigned AN12               : 1;
    unsigned AN10               : 1;
    unsigned AN8                : 1;
    unsigned AN9                : 1;
    unsigned AN11               : 1;
    unsigned AN13               : 1;
    unsigned CPSB14             : 1;
    unsigned CPSB15             : 1;
    };

  struct
    {
    unsigned CPSB8              : 1;
    unsigned CPSB9              : 1;
    unsigned CPSB10             : 1;
    unsigned CPSB11             : 1;
    unsigned CPSB12             : 1;
    unsigned CPSB13             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP2               : 1;
    unsigned                    : 1;
    unsigned T1G                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T3CKI              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTBbits_t;

extern __at(0x0006) volatile __PORTBbits_t PORTBbits;

#define _RB0                    0x01
#define _AN12                   0x01
#define _CPSB8                  0x01
#define _RB1                    0x02
#define _AN10                   0x02
#define _CPSB9                  0x02
#define _RB2                    0x04
#define _AN8                    0x04
#define _CPSB10                 0x04
#define _RB3                    0x08
#define _AN9                    0x08
#define _CPSB11                 0x08
#define _CCP2                   0x08
#define _RB4                    0x10
#define _AN11                   0x10
#define _CPSB12                 0x10
#define _RB5                    0x20
#define _AN13                   0x20
#define _CPSB13                 0x20
#define _T1G                    0x20
#define _T3CKI                  0x20
#define _RB6                    0x40
#define _CPSB14                 0x40
#define _RB7                    0x80
#define _CPSB15                 0x80

//==============================================================================


//==============================================================================
//        PORTC Bits

extern __at(0x0007) __sfr PORTC;

typedef union
  {
  struct
    {
    unsigned RC0                : 1;
    unsigned RC1                : 1;
    unsigned RC2                : 1;
    unsigned RC3                : 1;
    unsigned RC4                : 1;
    unsigned RC5                : 1;
    unsigned RC6                : 1;
    unsigned RC7                : 1;
    };

  struct
    {
    unsigned CPSB2              : 1;
    unsigned CPSB3              : 1;
    unsigned CPSB4              : 1;
    unsigned SCK                : 1;
    unsigned SDI                : 1;
    unsigned CPSA9              : 1;
    unsigned CPSA10             : 1;
    unsigned CPSA11             : 1;
    };

  struct
    {
    unsigned T1OSO              : 1;
    unsigned T1OSI              : 1;
    unsigned TBCKI              : 1;
    unsigned SCL                : 1;
    unsigned SDA                : 1;
    unsigned SDO                : 1;
    unsigned TX                 : 1;
    unsigned RX                 : 1;
    };

  struct
    {
    unsigned T1CKI              : 1;
    unsigned CCP2               : 1;
    unsigned CCP1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CK                 : 1;
    unsigned                    : 1;
    };
  } __PORTCbits_t;

extern __at(0x0007) volatile __PORTCbits_t PORTCbits;

#define _PORTC_RC0              0x01
#define _PORTC_CPSB2            0x01
#define _PORTC_T1OSO            0x01
#define _PORTC_T1CKI            0x01
#define _PORTC_RC1              0x02
#define _PORTC_CPSB3            0x02
#define _PORTC_T1OSI            0x02
#define _PORTC_CCP2             0x02
#define _PORTC_RC2              0x04
#define _PORTC_CPSB4            0x04
#define _PORTC_TBCKI            0x04
#define _PORTC_CCP1             0x04
#define _PORTC_RC3              0x08
#define _PORTC_SCK              0x08
#define _PORTC_SCL              0x08
#define _PORTC_RC4              0x10
#define _PORTC_SDI              0x10
#define _PORTC_SDA              0x10
#define _PORTC_RC5              0x20
#define _PORTC_CPSA9            0x20
#define _PORTC_SDO              0x20
#define _PORTC_RC6              0x40
#define _PORTC_CPSA10           0x40
#define _PORTC_TX               0x40
#define _PORTC_CK               0x40
#define _PORTC_RC7              0x80
#define _PORTC_CPSA11           0x80
#define _PORTC_RX               0x80

//==============================================================================


//==============================================================================
//        PORTD Bits

extern __at(0x0008) __sfr PORTD;

typedef union
  {
  struct
    {
    unsigned RD0                : 1;
    unsigned RD1                : 1;
    unsigned RD2                : 1;
    unsigned RD3                : 1;
    unsigned RD4                : 1;
    unsigned RD5                : 1;
    unsigned RD6                : 1;
    unsigned RD7                : 1;
    };

  struct
    {
    unsigned CPSB5              : 1;
    unsigned CPSB6              : 1;
    unsigned CPSB7              : 1;
    unsigned CPSA8              : 1;
    unsigned CPSA12             : 1;
    unsigned CPSA13             : 1;
    unsigned CPSA14             : 1;
    unsigned CPSA15             : 1;
    };

  struct
    {
    unsigned T3G                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTDbits_t;

