OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf707.h
#define _TAPS0                  0x01
#define _TMRAPS0                0x01
#define _TAPS1                  0x02
#define _TMRAPS1                0x02
#define _TAPS2                  0x04
#define _TMRAPS2                0x04
#define _TAPSA                  0x08
#define _TMRAPSA                0x08
#define _TASE                   0x10
#define _TMRASE                 0x10
#define _TACS                   0x20
#define _TMRACS                 0x20
#define _TMRAON                 0x80

//==============================================================================


//==============================================================================
//        CPSBCON0 Bits

extern __at(0x0106) __sfr CPSBCON0;

typedef union
  {
  struct
    {
    unsigned TBXCS              : 1;
    unsigned CPSBOUT            : 1;
    unsigned CPSBRNG0           : 1;
    unsigned CPSBRNG1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CPSBRM             : 1;
    unsigned CPSBON             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CPSBRNG            : 2;
    unsigned                    : 4;
    };
  } __CPSBCON0bits_t;

extern __at(0x0106) volatile __CPSBCON0bits_t CPSBCON0bits;

#define _TBXCS                  0x01
#define _CPSBOUT                0x02
#define _CPSBRNG0               0x04
#define _CPSBRNG1               0x08
#define _CPSBRM                 0x40
#define _CPSBON                 0x80

//==============================================================================


//==============================================================================
//        CPSBCON1 Bits

extern __at(0x0107) __sfr CPSBCON1;

typedef union
  {
  struct
    {
    unsigned CPSBCH0            : 1;
    unsigned CPSBCH1            : 1;
    unsigned CPSBCH2            : 1;
    unsigned CPSBCH3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CPSBCH             : 4;
    unsigned                    : 4;
    };
  } __CPSBCON1bits_t;

extern __at(0x0107) volatile __CPSBCON1bits_t CPSBCON1bits;

#define _CPSBCH0                0x01
#define _CPSBCH1                0x02
#define _CPSBCH2                0x04
#define _CPSBCH3                0x08

//==============================================================================


//==============================================================================
//        CPSACON0 Bits

extern __at(0x0108) __sfr CPSACON0;

typedef union
  {
  struct
    {
    unsigned TAXCS              : 1;
    unsigned CPSAOUT            : 1;
    unsigned CPSARNG0           : 1;
    unsigned CPSARNG1           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CPSARM             : 1;
    unsigned CPSAON             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CPSARNG            : 2;
    unsigned                    : 4;
    };
  } __CPSACON0bits_t;

extern __at(0x0108) volatile __CPSACON0bits_t CPSACON0bits;

#define _TAXCS                  0x01
#define _CPSAOUT                0x02
#define _CPSARNG0               0x04
#define _CPSARNG1               0x08
#define _CPSARM                 0x40
#define _CPSAON                 0x80

//==============================================================================


//==============================================================================
//        CPSACON1 Bits

extern __at(0x0109) __sfr CPSACON1;

typedef union
  {
  struct
    {
    unsigned CPSACH0            : 1;
    unsigned CPSACH1            : 1;
    unsigned CPSACH2            : 1;
    unsigned CPSACH3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CPSACH             : 4;
    unsigned                    : 4;
    };
  } __CPSACON1bits_t;

extern __at(0x0109) volatile __CPSACON1bits_t CPSACON1bits;

#define _CPSACH0                0x01
#define _CPSACH1                0x02
#define _CPSACH2                0x04
#define _CPSACH3                0x08

//==============================================================================

extern __at(0x010C) __sfr PMDATL;
extern __at(0x010D) __sfr PMADRL;
extern __at(0x010E) __sfr PMDATH;
extern __at(0x010F) __sfr PMADRH;
extern __at(0x0110) __sfr TMRA;

//==============================================================================
//        TBCON Bits

extern __at(0x0111) __sfr TBCON;

typedef union
  {
  struct
    {
    unsigned TBPS0              : 1;
    unsigned TBPS1              : 1;
    unsigned TBPS2              : 1;
    unsigned TBPSA              : 1;
    unsigned TBSE               : 1;
    unsigned TBCS               : 1;
    unsigned                    : 1;
    unsigned TMRBON             : 1;
    };

  struct
    {
    unsigned TMRBPS0            : 1;
    unsigned TMRBPS1            : 1;
    unsigned TMRBPS2            : 1;
    unsigned TMRBPSA            : 1;
    unsigned TMRBSE             : 1;
    unsigned TMRBCS             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TMRBPS             : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned TBPS               : 3;
    unsigned                    : 5;
    };
  } __TBCONbits_t;

extern __at(0x0111) volatile __TBCONbits_t TBCONbits;

#define _TBPS0                  0x01
#define _TMRBPS0                0x01
#define _TBPS1                  0x02
#define _TMRBPS1                0x02
#define _TBPS2                  0x04
#define _TMRBPS2                0x04
#define _TBPSA                  0x08
#define _TMRBPSA                0x08
#define _TBSE                   0x10
#define _TMRBSE                 0x10
#define _TBCS                   0x20
#define _TMRBCS                 0x20
#define _TMRBON                 0x80

//==============================================================================

extern __at(0x0112) __sfr TMRB;

//==============================================================================
//        DACCON0 Bits

extern __at(0x0113) __sfr DACCON0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DACPSS0            : 1;
    unsigned DACPSS1            : 1;
    unsigned                    : 1;
    unsigned DACOE              : 1;
    unsigned DACLPS             : 1;
    unsigned DACEN              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DACPSS             : 2;
    unsigned                    : 4;
    };
  } __DACCON0bits_t;

extern __at(0x0113) volatile __DACCON0bits_t DACCON0bits;

#define _DACPSS0                0x04
#define _DACPSS1                0x08
#define _DACOE                  0x20
#define _DACLPS                 0x40
#define _DACEN                  0x80

//==============================================================================


//==============================================================================
//        DACCON1 Bits

extern __at(0x0114) __sfr DACCON1;

typedef union
  {
  struct
    {
    unsigned DACR0              : 1;
    unsigned DACR1              : 1;
    unsigned DACR2              : 1;
    unsigned DACR3              : 1;
    unsigned DACR4              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned DACR               : 5;
    unsigned                    : 3;
    };
  } __DACCON1bits_t;

extern __at(0x0114) volatile __DACCON1bits_t DACCON1bits;

#define _DACR0                  0x01
#define _DACR1                  0x02
#define _DACR2                  0x04
#define _DACR3                  0x08
#define _DACR4                  0x10

//==============================================================================


//==============================================================================
//        ANSELA Bits

