OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf707.h
#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0
#define NOT_POR                 PCONbits.NOT_POR                // bit 1

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 2
#define SSPIE                   PIE1bits.SSPIE                  // bit 3
#define TXIE                    PIE1bits.TXIE                   // bit 4
#define RCIE                    PIE1bits.RCIE                   // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define TMR1GIE                 PIE1bits.TMR1GIE                // bit 7

#define CCP2IE                  PIE2bits.CCP2IE                 // bit 0
#define TMRAIE                  PIE2bits.TMRAIE                 // bit 4
#define TMRBIE                  PIE2bits.TMRBIE                 // bit 5
#define TMR3IE                  PIE2bits.TMR3IE                 // bit 6
#define TMR3GIE                 PIE2bits.TMR3GIE                // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 2
#define SSPIF                   PIR1bits.SSPIF                  // bit 3
#define TXIF                    PIR1bits.TXIF                   // bit 4
#define RCIF                    PIR1bits.RCIF                   // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define TMR1GIF                 PIR1bits.TMR1GIF                // bit 7

#define CCP2IF                  PIR2bits.CCP2IF                 // bit 0
#define TMRAIF                  PIR2bits.TMRAIF                 // bit 4
#define TMRBIF                  PIR2bits.TMRBIF                 // bit 5
#define TMR3IF                  PIR2bits.TMR3IF                 // bit 6
#define TMR3GIF                 PIR2bits.TMR3GIF                // bit 7

#define RD                      PMCON1bits.RD                   // bit 0

#define RA0                     PORTAbits.RA0                   // bit 0, shadows bit in PORTAbits
#define AN0                     PORTAbits.AN0                   // bit 0, shadows bit in PORTAbits
#define RA1                     PORTAbits.RA1                   // bit 1, shadows bit in PORTAbits
#define AN1                     PORTAbits.AN1                   // bit 1, shadows bit in PORTAbits
#define CPSA0                   PORTAbits.CPSA0                 // bit 1, shadows bit in PORTAbits
#define RA2                     PORTAbits.RA2                   // bit 2, shadows bit in PORTAbits
#define AN2                     PORTAbits.AN2                   // bit 2, shadows bit in PORTAbits
#define CPSA1                   PORTAbits.CPSA1                 // bit 2, shadows bit in PORTAbits
#define DACOUT                  PORTAbits.DACOUT                // bit 2, shadows bit in PORTAbits
#define RA3                     PORTAbits.RA3                   // bit 3, shadows bit in PORTAbits
#define AN3                     PORTAbits.AN3                   // bit 3, shadows bit in PORTAbits
#define CPSA2                   PORTAbits.CPSA2                 // bit 3, shadows bit in PORTAbits
#define RA4                     PORTAbits.RA4                   // bit 4, shadows bit in PORTAbits
#define CPSA3                   PORTAbits.CPSA3                 // bit 4, shadows bit in PORTAbits
#define T0CKI                   PORTAbits.T0CKI                 // bit 4, shadows bit in PORTAbits
#define TACKI                   PORTAbits.TACKI                 // bit 4, shadows bit in PORTAbits
#define RA5                     PORTAbits.RA5                   // bit 5, shadows bit in PORTAbits
#define AN4                     PORTAbits.AN4                   // bit 5, shadows bit in PORTAbits
#define CPSA4                   PORTAbits.CPSA4                 // bit 5, shadows bit in PORTAbits
#define RA6                     PORTAbits.RA6                   // bit 6, shadows bit in PORTAbits
#define OSC2                    PORTAbits.OSC2                  // bit 6, shadows bit in PORTAbits
#define CPSB1                   PORTAbits.CPSB1                 // bit 6, shadows bit in PORTAbits
#define CLKOUT                  PORTAbits.CLKOUT                // bit 6, shadows bit in PORTAbits
#define RA7                     PORTAbits.RA7                   // bit 7, shadows bit in PORTAbits
#define OSC1                    PORTAbits.OSC1                  // bit 7, shadows bit in PORTAbits
#define CPSB0                   PORTAbits.CPSB0                 // bit 7, shadows bit in PORTAbits
#define CLKIN                   PORTAbits.CLKIN                 // bit 7, shadows bit in PORTAbits

#define RB0                     PORTBbits.RB0                   // bit 0, shadows bit in PORTBbits
#define AN12                    PORTBbits.AN12                  // bit 0, shadows bit in PORTBbits
#define CPSB8                   PORTBbits.CPSB8                 // bit 0, shadows bit in PORTBbits
#define RB1                     PORTBbits.RB1                   // bit 1, shadows bit in PORTBbits
#define AN10                    PORTBbits.AN10                  // bit 1, shadows bit in PORTBbits
#define CPSB9                   PORTBbits.CPSB9                 // bit 1, shadows bit in PORTBbits
#define RB2                     PORTBbits.RB2                   // bit 2, shadows bit in PORTBbits
#define AN8                     PORTBbits.AN8                   // bit 2, shadows bit in PORTBbits
#define CPSB10                  PORTBbits.CPSB10                // bit 2, shadows bit in PORTBbits
#define RB3                     PORTBbits.RB3                   // bit 3, shadows bit in PORTBbits
#define AN9                     PORTBbits.AN9                   // bit 3, shadows bit in PORTBbits
#define CPSB11                  PORTBbits.CPSB11                // bit 3, shadows bit in PORTBbits
#define CCP2                    PORTBbits.CCP2                  // bit 3, shadows bit in PORTBbits
#define RB4                     PORTBbits.RB4                   // bit 4, shadows bit in PORTBbits
#define AN11                    PORTBbits.AN11                  // bit 4, shadows bit in PORTBbits
#define CPSB12                  PORTBbits.CPSB12                // bit 4, shadows bit in PORTBbits
#define RB5                     PORTBbits.RB5                   // bit 5, shadows bit in PORTBbits
#define AN13                    PORTBbits.AN13                  // bit 5, shadows bit in PORTBbits
#define CPSB13                  PORTBbits.CPSB13                // bit 5, shadows bit in PORTBbits
#define T1G                     PORTBbits.T1G                   // bit 5, shadows bit in PORTBbits
#define T3CKI                   PORTBbits.T3CKI                 // bit 5, shadows bit in PORTBbits
#define RB6                     PORTBbits.RB6                   // bit 6, shadows bit in PORTBbits
#define CPSB14                  PORTBbits.CPSB14                // bit 6, shadows bit in PORTBbits
#define RB7                     PORTBbits.RB7                   // bit 7, shadows bit in PORTBbits
#define CPSB15                  PORTBbits.CPSB15                // bit 7, shadows bit in PORTBbits

#define RD0                     PORTDbits.RD0                   // bit 0, shadows bit in PORTDbits
#define CPSB5                   PORTDbits.CPSB5                 // bit 0, shadows bit in PORTDbits
#define T3G                     PORTDbits.T3G                   // bit 0, shadows bit in PORTDbits
#define RD1                     PORTDbits.RD1                   // bit 1, shadows bit in PORTDbits
#define CPSB6                   PORTDbits.CPSB6                 // bit 1, shadows bit in PORTDbits
#define RD2                     PORTDbits.RD2                   // bit 2, shadows bit in PORTDbits
#define CPSB7                   PORTDbits.CPSB7                 // bit 2, shadows bit in PORTDbits
#define RD3                     PORTDbits.RD3                   // bit 3, shadows bit in PORTDbits
#define CPSA8                   PORTDbits.CPSA8                 // bit 3, shadows bit in PORTDbits
#define RD4                     PORTDbits.RD4                   // bit 4, shadows bit in PORTDbits
#define CPSA12                  PORTDbits.CPSA12                // bit 4, shadows bit in PORTDbits
#define RD5                     PORTDbits.RD5                   // bit 5, shadows bit in PORTDbits
#define CPSA13                  PORTDbits.CPSA13                // bit 5, shadows bit in PORTDbits
#define RD6                     PORTDbits.RD6                   // bit 6, shadows bit in PORTDbits
#define CPSA14                  PORTDbits.CPSA14                // bit 6, shadows bit in PORTDbits
#define RD7                     PORTDbits.RD7                   // bit 7, shadows bit in PORTDbits
#define CPSA15                  PORTDbits.CPSA15                // bit 7, shadows bit in PORTDbits

#define RE0                     PORTEbits.RE0                   // bit 0, shadows bit in PORTEbits
#define AN5                     PORTEbits.AN5                   // bit 0, shadows bit in PORTEbits
#define CPSA5                   PORTEbits.CPSA5                 // bit 0, shadows bit in PORTEbits
#define RE1                     PORTEbits.RE1                   // bit 1, shadows bit in PORTEbits
#define AN6                     PORTEbits.AN6                   // bit 1, shadows bit in PORTEbits
#define CPSA6                   PORTEbits.CPSA6                 // bit 1, shadows bit in PORTEbits
#define RE2                     PORTEbits.RE2                   // bit 2, shadows bit in PORTEbits
#define AN7                     PORTEbits.AN7                   // bit 2, shadows bit in PORTEbits
#define CPSA7                   PORTEbits.CPSA7                 // bit 2, shadows bit in PORTEbits
#define RE3                     PORTEbits.RE3                   // bit 3, shadows bit in PORTEbits
#define NOT_MCLR                PORTEbits.NOT_MCLR              // bit 3, shadows bit in PORTEbits

#define RX9D                    RCSTAbits.RX9D                  // bit 0
#define OERR                    RCSTAbits.OERR                  // bit 1
#define FERR                    RCSTAbits.FERR                  // bit 2
#define ADDEN                   RCSTAbits.ADDEN                 // bit 3
#define CREN                    RCSTAbits.CREN                  // bit 4
#define SREN                    RCSTAbits.SREN                  // bit 5
#define RX9                     RCSTAbits.RX9                   // bit 6
#define SPEN                    RCSTAbits.SPEN                  // bit 7

#define SSPM0                   SSPCONbits.SSPM0                // bit 0
#define SSPM1                   SSPCONbits.SSPM1                // bit 1
#define SSPM2                   SSPCONbits.SSPM2                // bit 2
#define SSPM3                   SSPCONbits.SSPM3                // bit 3
#define CKP                     SSPCONbits.CKP                  // bit 4
#define SSPEN                   SSPCONbits.SSPEN                // bit 5
#define SSPOV                   SSPCONbits.SSPOV                // bit 6
#define WCOL                    SSPCONbits.WCOL                 // bit 7

#define BF                      SSPSTATbits.BF                  // bit 0
#define UA                      SSPSTATbits.UA                  // bit 1
#define R_NOT_W                 SSPSTATbits.R_NOT_W             // bit 2
#define S                       SSPSTATbits.S                   // bit 3
#define P                       SSPSTATbits.P                   // bit 4
#define D_NOT_A                 SSPSTATbits.D_NOT_A             // bit 5
#define CKE                     SSPSTATbits.CKE                 // bit 6
#define SMP                     SSPSTATbits.SMP                 // bit 7

